// 必要な変数を定義する (02)

function setup() {
    createCanvas(600, 400);

    // 変数を初期化する (02)

}

function draw() {
    background(0);

    if (mode == 0) {
        // スタート画面の表示 (03)
        
    }
    
    if (mode == 1) {
        // ボールを動かす (04)
        
        // パドルを動かす (04)

        // 上に当たったら跳ね返る (05)

        // 右に当たったら跳ね返る (05)

        // 左に当たったら跳ね返る (05)
        
        // 下に当たったらゲームオーバー (07)

        // パドルに当たったら跳ね返る (06)

    }

    if (mode == 2) {
        // ゲームオーバー画面の表示 (07)

    }

    // ボールとパドルを表示する (02)

}

function mousePressed() {
    // スタート画面でマウスクリックされたらゲーム開始 (03)

    // ゲームオーバー画面でマウスクリックされたらスタート画面に戻る (07)
    
}